#### Terragrunt Format and Style 🖌 `success`
#### Terragrunt Initialization ⚙️ `success`
#### Terragrunt Validation 🤖 `success`
#### Terragrunt Plan 📖 `success`

<details><summary>Show Plan</summary>

```

Acquiring state lock. This may take a few moments...
data.aws_availability_zones.available: Reading...
data.aws_availability_zones.available: Read complete after 1s [id=eu-central-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name" = "pipeline-with-infracost-VPC-default"
        }
      + tags_all               = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "pipeline-with-infracost"
          + "Environment"      = "Development"
          + "Name"             = "pipeline-with-infracost-VPC-default"
          + "OwnerEmail"       = "akimratin@gmail.com"
          + "Project"          = "pipeline_with_infracost"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + egress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "pipeline-with-infracost-VPC-default"
        }
      + tags_all               = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "pipeline-with-infracost"
          + "Environment"      = "Development"
          + "Name"             = "pipeline-with-infracost-VPC-default"
          + "OwnerEmail"       = "akimratin@gmail.com"
          + "Project"          = "pipeline_with_infracost"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "pipeline-with-infracost-VPC-default"
        }
      + tags_all               = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "pipeline-with-infracost"
          + "Environment"      = "Development"
          + "Name"             = "pipeline-with-infracost-VPC-default"
          + "OwnerEmail"       = "akimratin@gmail.com"
          + "Project"          = "pipeline_with_infracost"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "pipeline-with-infracost-VPC"
        }
      + tags_all = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "pipeline-with-infracost"
          + "Environment"      = "Development"
          + "Name"             = "pipeline-with-infracost-VPC"
          + "OwnerEmail"       = "akimratin@gmail.com"
          + "Project"          = "pipeline_with_infracost"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "pipeline-with-infracost-VPC-private"
        }
      + tags_all         = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "pipeline-with-infracost"
          + "Environment"      = "Development"
          + "Name"             = "pipeline-with-infracost-VPC-private"
          + "OwnerEmail"       = "akimratin@gmail.com"
          + "Project"          = "pipeline_with_infracost"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "pipeline-with-infracost-VPC-public"
        }
      + tags_all         = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "pipeline-with-infracost"
          + "Environment"      = "Development"
          + "Name"             = "pipeline-with-infracost-VPC-public"
          + "OwnerEmail"       = "akimratin@gmail.com"
          + "Project"          = "pipeline_with_infracost"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "pipeline-with-infracost-VPC-private-eu-central-1a"
        }
      + tags_all                                       = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "pipeline-with-infracost"
          + "Environment"      = "Development"
          + "Name"             = "pipeline-with-infracost-VPC-private-eu-central-1a"
          + "OwnerEmail"       = "akimratin@gmail.com"
          + "Project"          = "pipeline_with_infracost"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "pipeline-with-infracost-VPC-private-eu-central-1b"
        }
      + tags_all                                       = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "pipeline-with-infracost"
          + "Environment"      = "Development"
          + "Name"             = "pipeline-with-infracost-VPC-private-eu-central-1b"
          + "OwnerEmail"       = "akimratin@gmail.com"
          + "Project"          = "pipeline_with_infracost"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "pipeline-with-infracost-VPC-private-eu-central-1c"
        }
      + tags_all                                       = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "pipeline-with-infracost"
          + "Environment"      = "Development"
          + "Name"             = "pipeline-with-infracost-VPC-private-eu-central-1c"
          + "OwnerEmail"       = "akimratin@gmail.com"
          + "Project"          = "pipeline_with_infracost"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.21.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "pipeline-with-infracost-VPC-public-eu-central-1a"
        }
      + tags_all                                       = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "pipeline-with-infracost"
          + "Environment"      = "Development"
          + "Name"             = "pipeline-with-infracost-VPC-public-eu-central-1a"
          + "OwnerEmail"       = "akimratin@gmail.com"
          + "Project"          = "pipeline_with_infracost"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.22.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "pipeline-with-infracost-VPC-public-eu-central-1b"
        }
      + tags_all                                       = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "pipeline-with-infracost"
          + "Environment"      = "Development"
          + "Name"             = "pipeline-with-infracost-VPC-public-eu-central-1b"
          + "OwnerEmail"       = "akimratin@gmail.com"
          + "Project"          = "pipeline_with_infracost"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.23.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "pipeline-with-infracost-VPC-public-eu-central-1c"
        }
      + tags_all                                       = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "pipeline-with-infracost"
          + "Environment"      = "Development"
          + "Name"             = "pipeline-with-infracost-VPC-public-eu-central-1c"
          + "OwnerEmail"       = "akimratin@gmail.com"
          + "Project"          = "pipeline_with_infracost"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "pipeline-with-infracost-VPC"
        }
      + tags_all                             = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "pipeline-with-infracost"
          + "Environment"      = "Development"
          + "Name"             = "pipeline-with-infracost-VPC"
          + "OwnerEmail"       = "akimratin@gmail.com"
          + "Project"          = "pipeline_with_infracost"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_subnets = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets  = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + vpc_cidr_block  = "10.0.0.0/16"
  + vpc_id          = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.sg will be created
  + resource "aws_security_group" "sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.10.0.0/16",
                  + "192.168.0.0/16",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "pipeline-with-infracost-bastion-host-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "pipeline-with-infracost-bastion-host-sg"
        }
      + tags_all               = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "pipeline-with-infracost"
          + "Environment"      = "Development"
          + "Name"             = "pipeline-with-infracost-bastion-host-sg"
          + "OwnerEmail"       = "akimratin@gmail.com"
          + "Project"          = "pipeline_with_infracost"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc_id                 = "vpc-fake-id"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + sg_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Acquiring state lock. This may take a few moments...
data.aws_partition.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0857949e0aef0e356"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-fake"
      + tags                                 = {
          + "Name" = "pipeline-with-infracost-bastion-host"
        }
      + tags_all                             = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "pipeline-with-infracost"
          + "Environment"      = "Development"
          + "Name"             = "pipeline-with-infracost-bastion-host"
          + "OwnerEmail"       = "akimratin@gmail.com"
          + "Project"          = "pipeline_with_infracost"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "pipeline-with-infracost-bastion-host"
        }
      + vpc_security_group_ids               = [
          + "sg-fake-id",
        ]

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + credit_specification {}

      + ebs_block_device (known after apply)

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)

      + timeouts {}
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ami                                = "ami-0857949e0aef0e356"
  + arn                                = (known after apply)
  + availability_zone                  = (known after apply)
  + capacity_reservation_specification = (known after apply)
  + ebs_block_device                   = (known after apply)
  + ephemeral_block_device             = (known after apply)
  + id                                 = (known after apply)
  + instance_state                     = (known after apply)
  + ipv6_addresses                     = (known after apply)
  + outpost_arn                        = (known after apply)
  + password_data                      = (known after apply)
  + primary_network_interface_id       = (known after apply)
  + private_dns                        = (known after apply)
  + private_ip                         = (known after apply)
  + public_dns                         = (known after apply)
  + public_ip                          = (known after apply)
  + root_block_device                  = (known after apply)
  + tags_all                           = {
      + DeployedBy       = "Terraform"
      + DeploymentPrefix = "pipeline-with-infracost"
      + Environment      = "Development"
      + Name             = "pipeline-with-infracost-bastion-host"
      + OwnerEmail       = "akimratin@gmail.com"
      + Project          = "pipeline_with_infracost"
      + Team             = "DevOps"
      + TerminationDate  = "Permanent"
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

Results for commit: 820d733f5f5a528717dbec34fc7141dc178116af

*Pusher: @Sayafayas, Action: `pull_request`, Working Directory: `dev`, Workflow: `Terragrunt CI/CD Pipeline`*